import {NavItem} from "vuepress/config";

export default [
    {
        text: "IT技术",
        link: '/IT技术/',
        items: [
            {
                text: "学习路线",
                link: '/学习路线/'
            },
            {
                text: "操作系统", link: "/IT技术/#操作系统",
            },
            {
                text: "Java", link: "/IT技术/#Java",
            },
            {
                text: "Golang", link: "/IT技术/#Golang",
            },
            {
                text: "C++", link: "/IT技术/#C++",
            },
            {
                text: "C#", link: "/IT技术/#C#",
            },
            {
                text: "Python", link: "/IT技术/#Python",
            },
            {
                text: "前端", link: "/IT技术/#前端",
            },
            {
                text: "数据库", link: "/IT技术/#数据库",
            },
            {
                text: "大数据", link: "/IT技术/#大数据",
            },
            {
                text: "微服务", link: "/IT技术/#微服务",
            },
            {
                text: "AIGC", link: "/IT技术/#AIGC",
            },
            {
                text: "安全", link: "/IT技术/#安全",
            },
            {
                text: "其他", link: "/IT技术/#其他",
            }
        ]
    },
    {
        text: "项目实战",
        link: '/项目实战/',
        items: [
            {
                text: "代码生成器共享平台",link: "/项目实战/代码生成器共享平台.md"
            },
            {
                text: "聚合搜索平台", link: "/项目实战/聚合搜索平台.md",
            },
            {
                text: "API 开放平台", link: "/项目实战/API 开放平台.md",
            },
            {
                text: "用户中心项目", link: "/项目实战/用户中心项目.md",
            },
            {
                text: "Java 后端万用项目模板", link: "/项目实战/Java 后端万用项目模板.md",
            },
        ]
    },
    {
        text: "知识碎片",
        link: '/知识碎片/',
    },
    {
        text: "行业认知",
        link: '/行业认知/',
        items: [
            {
                text: "电力系统",link: "/行业认知/电力系统/电力系统.md"
            },
            {
                text: "医疗器械IVD",link: "/行业认知/医疗器械IVD/医疗器械IVD.md"
            },
            {
                text: "在线教育",link: "/行业认知/在线教育/在线教育.md"
            },

        ]
    },
    {
        text: "茶",
        link: '/茶/',
    },
    {
        text: "国学",
        link: '/国学/',
        items: [
            {
                text: "经典",link: "/国学/经典/国学经典.md"
            },
            {
                text: "儒学",link: "/国学/儒学/儒学.md"
            },
            {
                text: "道教",link: "/国学/道教/道教.md"
            },
            {
                text: "佛教",link: "/国学/佛教/佛教.md"
            },
        ]
    },
    {
        text: "作者",
        link: '/作者/',
        items: [
            {
                text: "入门必看-学习路线", link: "/编程分享/#入门必看-学习路线",
            },
            {
                text: "学习指南", link: "/编程分享/#学习指南",
            },
            {
                text: "开发经验", link: "/编程分享/#开发经验",
            },
            {
                text: "求职经验", link: "/编程分享/#求职经验",
            },
            {
                text: "职场经验", link: "/编程分享/#职场经验",
            },
            {
                text: "技术分享", link: "/编程分享/#技术分享",
            },
            {
                text: "实战教程", link: "/编程分享/#实战教程",
            },
            {
                text: "其他", link: "/编程分享/#其他",
            },
            {
                text: "项目教程", link: "/编程分享/#📚-项目教程",
            },
            {
                text: "个人作品", link: "/编程分享/#个人作品",
            },

            {
                text: "编程资源", link: "/编程分享/#🎁-编程资源",
            },

            {
                text: "科技科普", link: "/编程分享/#🌐-科技科普",
            },
        ]
    },
] as NavItem[];
