export default [
  "",
  {
    title: "大学经历",
    collapsable: true,
    children: [
      "大学经历/mydjin的考证经历.md",
      "大学经历/mydjin的毕业设计，时隔一年，仍感觉头秃.md",
      "大学经历/mydjin的毕业感受.md"
    ],
  },
  {
    title: "求职经历",
    collapsable: true,
    children: [
      "求职经历/我的第一份实习，坐地铁上班.md",
      "求职经历/专业排名靠前，却找不到工作.md"
    ],
  },
  {
    title: "职场工作",
    collapsable: true,
    children: [
      "职场工作/Java开发者工作都做什么？.md",
      "职场工作/我从导师身上学到了什么？.md"
    ],
  },
  // {
  //   title: "创作经历",
  //   collapsable: true,
  //   children: [
  //     "创作经历/毕业这年，我成为了一名UP主.md",
  //     "创作经历/我也拥有了10万粉丝.md",
  //     "创作经历/10w粉丝，我却哭了.md",
  //     "创作经历/mydjin工作+创作的日常生活.md",
  //     "创作经历/二十四.md",
  //     "创作经历/今天，我要搞件大事！.md",
  //     "创作经历/我们搞了件大事！.md",
  //     "创作经历/一次很意外的网站故障经历。.md",
  //     "创作经历/一次面向UP主的团建.md",
  //     "创作经历/“老师，我谢谢你！”.md",
  //     "创作经历/我被最恨的公司采访了！.md",
  //     "创作经历/帮阿里云拉新7000人，我输的很彻底！.md",
  //     "创作经历/网站又被攻击，我心态崩了.md",
  //     "创作经历/来了来了！.md",
  //   ],
  // },
  {
    title: "生活日常",
    collapsable: true,
    children: [
    ],
  },
];
